BOQ/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Только для персональных групп доступа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователей</name>
    <comment>В качестве типа используется пустая ссылка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BOQ/src/Catalogs/ГруппыДоступа/ObjectModule.bsl
Перем СоставПользователей;

Процедура ПередЗаписью ( Отказ )
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	убратьДубли ();
	заполнитьСоставПользователей ();
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	обновитьРолиПользователей ();
	ДоступСервер.ОбновитьРолиПользователей ( СоставПользователей );
	
КонецПроцедуры

Процедура заполнитьСоставПользователей ()
	
	СоставПользователей = Новый Массив ();
	Если ( НЕ ЭтоНовый () ) Тогда
		с = "
		|выбрать различные Пользователь как Пользователь
		|из Справочник.ГруппыДоступа.Пользователи
		|где Ссылка = &Ссылка
		|";
		запрос = Новый Запрос ( с );
		запрос.УстановитьПараметр ( "Ссылка", Ссылка );
		результат = запрос.Выполнить ();
		выборка = результат.Выбрать ();
		Пока ( выборка.Следующий () ) Цикл
			СоставПользователей.Добавить ( выборка.Пользователь );	
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Процедура обновитьРолиПользователей ()
	
	Для Каждого строкаТЧ Из Пользователи Цикл
		Если ( СоставПользователей.Найти ( строкаТЧ.Пользователь ) = Неопределено ) Тогда
			СоставПользователей.Добавить ( строкаТЧ.Пользователь );
		КонецЕсли;
	КонецЦикла;
	ДоступСервер.ОбновитьРолиПользователей ( СоставПользователей );	
	
КонецПроцедуры

Процедура убратьДубли ()
	
	тз = Пользователи.Выгрузить ();
	тз.Свернуть ( "Пользователь" );
	Пользователи.Загрузить ( тз );
	
КонецПроцедуры

СоставПользователей = Новый Массив ();
